share/tutorials/incompressible/ico/cavity_clipped/0/p
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
  lid
  {
    type  zeroGradient;
  }
  fixedWalls
  {
    type  zeroGradient;
  }
  frontAndBack
  {
    type  empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
