share/tutorials/incompressible/ico/cavity_clipped/system/blockMeshDict
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.1;

vertices
(
  (0 0 0)
  (0.6 0 0)
  (0 0.4 0)
  (0.6 0.4 0)
  (1 0.4 0)
  (0 1 0)
  (0.6 1 0)
  (1 1 0)

  (0 0 0.1)
  (0.6 0 0.1)
  (0 0.4 0.1)
  (0.6 0.4 0.1)
  (1 0.4 0.1)
  (0 1 0.1)
  (0.6 1 0.1)
  (1 1 0.1)
);

blocks
(
  hex (0 1 3 2 8 9 11 10) (12 8 1) simpleGrading (1 1 1)
  hex (2 3 6 5 10 11 14 13) (12 12 1) simpleGrading (1 1 1)
  hex (3 4 7 6 11 12 15 14) (8 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  lid
  {
    type wall;
    faces
    (
      (5 13 14 6)
      (6 14 15 7)
    );
  }
  fixedWalls
  {
    type wall;
    faces
    (
      (0 8 10 2)
      (2 10 13 5)
      (7 15 12 4)
      (4 12 11 3)
      (3 11 9 1)
      (1 9 8 0)
    );
  }
  frontAndBack
  {
    type empty;
    faces
    (
      (0 2 3 1)
      (2 5 6 3)
      (3 6 7 4)
      (8 9 11 10)
      (10 11 14 13)
      (11 12 15 14)
    );
  }
);

mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
